                    ### Функции ###

""" Single-row - сколько Input ей дашь столько получишь Output."""
# Character - это функции которые работают с текстом(string).
# Numeric - это функции которые работают с числами.
# Date - функции которые работают с датами.
# Conversion - это функции которые конвертируют то есть преобразовывают тип данных.
# General(общие) - эти функции работают с NULL значениями, а так же способствует преминению логических условия в SELECT.

"""Multiple-row - может принимать много Input но выдаст только один Output."""